In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
# Return a series of boolean value
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
# dropna - filter axis label based on if there are missing data
# fillna - fill in missing data with some value
# isnull - return boolean series indicating which value is missing/NA
# notnull - negation of isnull

In [8]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
# dropna() is the same as
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.rand(7, 3))

In [18]:
# From the start to 4th row, column index = 1
df.iloc[:4, 1] = NA

# From the start to the 2nd row, column index = 2
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  0.396848       NaN       NaN
1  0.786279       NaN       NaN
2  0.263688       NaN  0.437703
3  0.259198       NaN  0.054433
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [20]:
df.dropna()

          0         1         2
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [21]:
df.dropna(thresh=2)

          0         1         2
2  0.263688       NaN  0.437703
3  0.259198       NaN  0.054433
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [22]:
df.fillna(0)

          0         1         2
0  0.396848  0.000000  0.000000
1  0.786279  0.000000  0.000000
2  0.263688  0.000000  0.437703
3  0.259198  0.000000  0.054433
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [23]:
# call fillna with a dict and use different fill value for each column
df.fillna({1: 0.5, 2:0})

          0         1         2
0  0.396848  0.500000  0.000000
1  0.786279  0.500000  0.000000
2  0.263688  0.500000  0.437703
3  0.259198  0.500000  0.054433
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [24]:
_ = df.fillna(0, inplace=True)

In [25]:
df

          0         1         2
0  0.396848  0.000000  0.000000
1  0.786279  0.000000  0.000000
2  0.263688  0.000000  0.437703
3  0.259198  0.000000  0.054433
4  0.705595  0.241662  0.223118
5  0.165639  0.017462  0.117500
6  0.095506  0.869735  0.656297

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))

In [27]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [28]:
df

          0         1         2
0  2.393378  0.537446  0.341368
1 -0.741451 -2.000032  0.413432
2 -1.853273       NaN -0.211619
3  1.802553       NaN  0.473037
4  0.708275       NaN       NaN
5 -0.214855       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  2.393378  0.537446  0.341368
1 -0.741451 -2.000032  0.413432
2 -1.853273 -2.000032 -0.211619
3  1.802553 -2.000032  0.473037
4  0.708275 -2.000032  0.473037
5 -0.214855 -2.000032  0.473037

In [31]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  2.393378  0.537446  0.341368
1 -0.741451 -2.000032  0.413432
2 -1.853273 -2.000032 -0.211619
3  1.802553 -2.000032  0.473037
4  0.708275       NaN  0.473037
5 -0.214855       NaN  0.473037

In [32]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [34]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})

In [35]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data['v1'] = range(7)

In [38]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [56]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'Pastrami', 'honey ham', 'noval lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     Pastrami     3.0
7    honey ham     5.0
8    noval lox     6.0

In [58]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'honey ham': 'pig',
    'noval lox': 'salmon',
    'corned beef': 'cow'
}

In [48]:
lowercased = data['food'].str.lower()

In [45]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5         beacon
6       pastrami
7      honey ham
8      noval lox
Name: food, dtype: object

In [49]:
data['animal'] = lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    NaN
5       Beacon     8.0    NaN
6     Pastrami     3.0    cow
7    honey ham     5.0    pig
8    noval lox     6.0    NaN

In [59]:
# Smarter / advanced way
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [61]:
data = pd.Series([1., -999, 2., -999., -1000., 3.])

In [62]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [64]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [65]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [66]:
data.replace([-999, -1000], [NA, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [67]:
data.replace({-999: NA, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [70]:
transform = lambda x: x[:4].upper()

In [71]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [72]:
# Modifying the DataFrame in-place:
data.index = data.index.map(transform)

In [73]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [74]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [75]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [76]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [77]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11